import networkx as nx
import matplotlib.pyplot as plt

metro_graph = nx.Graph()

stations = [
    "Хрещатик", "Майдан Незалежності", 
    "Театральна", "Золоті ворота", 
    "Палац спорту", "Площа Героїв", 
    "Поштова площа", "Контрактова", 
    "Печерська", "Кловська",
    "Вокзальна", "Університет", 
    "Арсенальна", "Дніпро", "Олімпійська", "Лук'янівська"
]

metro_graph.add_nodes_from(stations)

edges = [
    ("Хрещатик", "Майдан Незалежності"), 
    ("Хрещатик", "Театральна"),
    ("Хрещатик", "Арсенальна"),
    ("Театральна", "Золоті ворота"),
    ("Театральна", "Університет"),
    ("Золоті ворота", "Лук'янівська"),
    ("Золоті ворота", "Палац спорту"),
    ("Університет", "Вокзальна"),
    ("Майдан Незалежності", "Площа Героїв"),
    ("Майдан Незалежності", "Поштова площа"),
    ("Поштова площа", "Контрактова"),
    ("Площа Героїв","Палац спорту"),
    ("Олімпійська", "Площа Героїв"),
    ("Палац спорту", "Кловська"),
    ("Кловська", "Печерська"),
    ("Арсенальна", "Дніпро")
]

metro_graph.add_edges_from(edges)

weights = {
    ("Хрещатик", "Майдан Незалежності") : 1, 
    ("Хрещатик", "Театральна") : 2,
    ("Хрещатик", "Арсенальна") : 2,
    ("Театральна", "Золоті ворота") : 1,
    ("Театральна", "Університет") : 2,
    ("Золоті ворота", "Лук'янівська") : 2,
    ("Золоті ворота", "Палац спорту") : 2,
    ("Університет", "Вокзальна") : 2,
    ("Майдан Незалежності", "Площа Героїв") : 2,
    ("Майдан Незалежності", "Поштова площа") : 2,
    ("Поштова площа", "Контрактова") : 2,
    ("Площа Героїв","Палац спорту") : 1,
    ("Олімпійська", "Площа Героїв") : 2,
    ("Палац спорту", "Кловська") : 2,
    ("Кловська", "Печерська") : 2,
    ("Арсенальна", "Дніпро") : 2
}

nx.set_edge_attributes(metro_graph, weights, "weight")

plt.figure(figsize=(12, 8))
pos = nx.spring_layout(metro_graph, seed=42)

nx.draw(metro_graph, pos, with_labels=True, node_color="skyblue", node_size=3000, font_size=10, edge_color="gray")
labels = nx.get_edge_attributes(metro_graph, "weight")
nx.draw_networkx_edge_labels(metro_graph, pos, edge_labels=labels, font_size=8)

plt.title("Мережа метро Києва")
plt.show()
